Вариант 9

1. Подсчитать какой процент пассажиров путешествовали 1 классом.
2. Отобрать всех пассажиров мужчин старше 40.
3. Отсортировать все столбцы по наименованию.
4. Задать количество строк и столбцов для отображения объектов Pandas: 14 строк, 3 столбца.
5. Создать объект DataFrame с данными о планетах солнечной системы (название, диаметр планеты, масса, расстояние от Солнца)
   1) Отобрать планеты, что расположены дальше от Солнца, чем Земля.
   2) Отобрать 3 крупнейшие по массе планеты.
   3) Отсортировать планеты по возрастанию по столбцу «диаметр».

In [12]:
from pathlib import Path

import pandas as pd

In [ ]:
data = Path("data/titanic.csv")
df = pd.read_csv(data, index_col="PassengerId")

In [14]:
"""
Подсчитать какой процент пассажиров путешествовали 1 классом.
"""

percentage_first_class = (
    df["Pclass"] == 1
).mean() * 100  # mean() - среднее арифметическое

print(f"{percentage_first_class:.1f}%")

24.2%

In [15]:
"""
Отобрать всех пассажиров мужчин старше 40.
"""

men_over_40 = df[(df["Sex"] == "male") & (df["Age"] > 40)]

print(men_over_40.shape[0])

display(men_over_40)

102

             Survived  ...  Embarked
PassengerId            ...
7                   0  ...         S
34                  0  ...         S
36                  0  ...         S
55                  0  ...         C
63                  0  ...         S
...               ...  ...       ...
846                 0  ...         S
852                 0  ...         S
858                 1  ...         S
861                 0  ...         S
874                 0  ...         S

[102 rows x 11 columns]

In [16]:
"""
Отсортировать все столбцы по наименованию.
"""

df_sorted = df[sorted(df.columns)]

display(df_sorted)

              Age  ...            Ticket
PassengerId        ...
1            22.0  ...         A/5 21171
2            38.0  ...          PC 17599
3            26.0  ...  STON/O2. 3101282
4            35.0  ...            113803
5            35.0  ...            373450
...           ...  ...               ...
887          27.0  ...            211536
888          19.0  ...            112053
889           NaN  ...        W./C. 6607
890          26.0  ...            111369
891          32.0  ...            370376

[891 rows x 11 columns]

In [17]:
"""
Задать количество строк и столбцов для отображения объектов Pandas: 14 строк, 3 столбца.
"""

display(df.iloc[:14, :3])

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"
6,0,3,"Moran, Mr. James"
7,0,1,"McCarthy, Mr. Timothy J"
8,0,3,"Palsson, Master. Gosta Leonard"
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)"
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)"
11,1,3,"Sandstrom, Miss. Marguerite Rut"
12,1,1,"Bonnell, Miss. Elizabeth"
13,0,3,"Saundercock, Mr. William Henry"
14,0,3,"Andersson, Mr. Anders Johan"

In [18]:
"""
Создать объект DataFrame с данными о планетах солнечной системы
(название, диаметр планеты, масса, расстояние от Солнца)
   1) Отобрать планеты, что расположены дальше от Солнца, чем Земля.
   2) Отобрать 3 крупнейшие по массе планеты.
   3) Отсортировать планеты по возрастанию по столбцу «диаметр».
"""

planets = pd.DataFrame(
    {
        "name": [
            "Меркурий",
            "Венера",
            "Земля",
            "Марс",
            "Юпитер",
            "Сатурн",
            "Уран",
            "Нептун",
        ],
        "diameter": [4879, 12104, 12742, 6779, 139820, 116460, 50724, 49244],  # км
        "mass": [0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102],  # 10^24 кг
        "distance_from_the_sun": [
            57.9,
            108.2,
            149.6,
            227.9,
            778.5,
            1434,
            2871,
            4495,
        ],  # млн км
    }
)

earth_distance = planets[planets["name"] == "Земля"]["distance_from_the_sun"].values[0]
planets_beyond_earth = planets[planets["distance_from_the_sun"] > earth_distance]

print("Планеты дальше от Солнца, чем Земля:")
display(planets_beyond_earth)

top_3_massive = planets.nlargest(3, "mass")

print("Топ-3 по массе планеты:")
display(top_3_massive)

planets_sorted_by_diameter = planets.sort_values("diameter")

print("Планеты, отсортированные по диаметру:")
display(planets_sorted_by_diameter)

Планеты дальше от Солнца, чем Земля:

     name  ...  distance_from_the_sun
3    Марс  ...                  227.9
4  Юпитер  ...                  778.5
5  Сатурн  ...                 1434.0
6    Уран  ...                 2871.0
7  Нептун  ...                 4495.0

[5 rows x 4 columns]

Топ-3 по массе планеты:

     name  ...  distance_from_the_sun
4  Юпитер  ...                  778.5
5  Сатурн  ...                 1434.0
7  Нептун  ...                 4495.0

[3 rows x 4 columns]

Планеты, отсортированные по диаметру:

       name  ...  distance_from_the_sun
0  Меркурий  ...                   57.9
3      Марс  ...                  227.9
1    Венера  ...                  108.2
2     Земля  ...                  149.6
7    Нептун  ...                 4495.0
6      Уран  ...                 2871.0
5    Сатурн  ...                 1434.0
4    Юпитер  ...                  778.5

[8 rows x 4 columns]